set nocompatible "vi互換にしない
"------------------------------------------------------------------------
"" 表示
"------------------------------------------------------------------------
set showmode "現在のモードを表示
set showcmd "コマンドを表示
set number
set ruler
"
"" 最下ウィンドウにいつステータス行が表示されるかを設定する。
"                0:まったく表示しない
"                1:ウィンドウの数が2以上のときのみ表示
"                2:常に表示
set laststatus=2
"
"" ステータスライン
set statusline=%f%=%<%m%r[%{(&fenc!=''?&fenc)}][%{&ff}][%Y][%v,%l/%L]
"
syntax enable
filetype plugin indent on
"------------------------------------------------------------------------
"" コマンドモード
"------------------------------------------------------------------------
set wildmode=list:longest "コマンドモードの補完
set history=100000 "保存する履歴の数
"" 前方一致検索をCtrl+PとCtrl+Nで
cnoremap <C-P> <UP>
cnoremap <C=N> <DOWN>
"------------------------------------------------------------------------
"" バッファの切り替え
"------------------------------------------------------------------------
nnoremap <C-n> :bn<CR>
nnoremap <C-p> :bp<CR>
set hidden "変更中のバッファを保存しないで他のバッファを表示
"
"
""-----------------------------------------------------------------------
" タブ・インデント
""-----------------------------------------------------------------------
set tabstop=4 "ファイル内の<tab>が対応する空白の数
set softtabstop=4 "<tab>の挿入や<bs>の使用等の編集操作をするときに、<tab>が対応する空白の数
set shiftwidth=4 "インデントの各段階に使われる空白の数
set expandtab
set autoindent "新しい行のインデントを現在行と同じくする
set smartindent
"
"------------------------------------------------------------------------
"" paste
"------------------------------------------------------------------------
" pasteモードのトグル。autoindentをonにしてペーストすると
" インデントが入った文章が階段状になってしまう。
" pasteモードではautoindentが解除される
set pastetoggle=<F11>
"
"
"------------------------------------------------------------------------
"" 検索
"------------------------------------------------------------------------
set incsearch
set ignorecase "検索パターンに大文字を含まなければ大文字小文字を区別しない
set smartcase "検索パターンに大文字を含んでいたら大文字小文字を区別する
set nohlsearch "検索結果をハイライトしない
" ESCキー2度押しでハイライトのトグル
"
"------------------------------------------------------------------------
"" カーソル
"------------------------------------------------------------------------
" カーソルを表示行で移動する
nnoremap j gj
nnoremap k gk
nnoremap <down> gj
nnoremap <up> gk
"
"" backspaceキーの挙動を設定する
""  indent    :行頭の空白の削除を許す
""  eol       :開業の削除を許す
""  start     :挿入モードの開始位置での削除を許す
set backspace=indent,eol,start
"
"------------------------------------------------------------------------
"" カッコ・タグの対応
"------------------------------------------------------------------------
set showmatch "括弧の対応
source $VIMRUNTIME/macros/matchit.vim "HTMLタグをマッチさせる
"
"------------------------------------------------------------------------
"" マップ
"------------------------------------------------------------------------
imap jj <ESC> "jjでノーマルモードへ
"
"------------------------------------------------------------------------
"" 文字コード
"------------------------------------------------------------------------
set encoding=utf-8
set fileencodings=utf-8,euc-jp.cp932





